 [
  {
    "id": "POLITY_2013_001",
    "year": 2013,
    "subject": "Polity",
    "topic": "Constitutional Amendment",
    "subtopic": "Amendment Process and Federal Character",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. An amendment to the Constitution of India can be initiated by the introduction of a bill in the Lok Sabha only. 2. If such an amendment seeks to make changes in the federal character of the Constitution, the amendment also requires to be ratified by the legislature of all the States of India.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 3,
    "correct_option_label": "D",
    "explanation": "Statement 1 is incorrect: An amendment to the Constitution can be initiated in either the Lok Sabha or Rajya Sabha, not exclusively in the Lok Sabha. Statement 2 is incorrect: While certain amendments require ratification by state legislatures, this requirement applies only to amendments affecting the representation of states in Parliament or the executive powers of the state, not all amendments affecting federal character. The requirement mandates ratification by at least half of the state legislatures, not all states.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["constitutional_amendment", "federal_character", "parliament"],
    "notes": "Tests understanding of constitutional amendment procedure and federal structure protection mechanisms",
    "linked_concepts": ["Article 368", "Federal Structure", "Constitutional Amendment", "State Legislature"]
  },
  {
    "id": "POLITY_2013_002",
    "year": 2013,
    "subject": "Polity",
    "topic": "Governor",
    "subtopic": "Governor's Position and Appointment",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Which one of the following statements is correct? 1. In India, the same person cannot be appointed as Governor for two or more States at the same time. 2. The Judges of the High Court of the States in India are appointed by the Governor of the State just as the Judges of the Supreme Court are appointed by the President. 3. No procedure has been laid down in the Constitution of India for the removal of a Governor from his/her post. 4. In the case of a Union Territory having a legislative setup, the Chief Minister is appointed by the Lt. Governor on the basis of majority support.",
    "options": [
      "1, 2 and 3 only",
      "3 only",
      "2 and 3 only",
      "1, 2 and 4 only"
    ],
    "correct_option_index": 3,
    "correct_option_label": "D",
    "explanation": "Statement 1 is correct: The Constitution does not prohibit a person from being Governor of more than one state, though current practice limits it to one state. Actually, historically, the same person has served as Governor of multiple states. Statement 2 is incorrect: High Court judges are appointed by the President, not the Governor, though on the recommendation of the Chief Justice and Governor. Statement 3 is incorrect: Article 156(1) provides for removal of Governor on grounds including violation of Constitution. Statement 4 is correct: Chief Minister of a UT with legislative assembly is appointed by the Lt. Governor based on majority support in assembly.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["governor", "union_territory", "judicial_appointments"],
    "notes": "Clarifies the institutional position of Governor and related constitutional provisions",
    "linked_concepts": ["Article 156", "Article 155", "Governor's Powers", "Judicial Appointments"]
  },
  {
    "id": "POLITY_2013_003",
    "year": 2013,
    "subject": "Polity",
    "topic": "Planning Bodies",
    "subtopic": "Planning Commission and NDC",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Which of the following bodies does not/do not find mention in the Constitution? 1. National Development Council. 2. Planning Commission. 3. Zonal Councils.",
    "options": [
      "1 and 2 only",
      "2 only",
      "1 and 3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 0,
    "correct_option_label": "A",
    "explanation": "The National Development Council and Planning Commission are extra-constitutional bodies created by executive decision/resolution, not mentioned in the Constitution. They were established through cabinet resolutions and administrative decisions. However, Zonal Councils are mentioned in Article 263 of the Constitution. The Constitution provides for the establishment of Zonal Councils as inter-state bodies, making only NDC and Planning Commission extra-constitutional.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["constitutional_bodies", "planning_commission", "national_development_council"],
    "notes": "Tests knowledge of constitutional status of various governance bodies in India",
    "linked_concepts": ["Article 263", "Extra-Constitutional Bodies", "Federal Structure"]
  },
  {
    "id": "POLITY_2013_004",
    "year": 2013,
    "subject": "Polity",
    "topic": "Attorney General",
    "subtopic": "Powers and Privileges of Attorney General",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: Attorney General of India can: 1. take part in the proceedings of the Lok Sabha. 2. be a member of a committee of the Lok Sabha. 3. speak in the Lok Sabha. 4. vote in the Lok Sabha.",
    "options": [
      "1 only",
      "2 and 4 only",
      "2 and 3 only",
      "1 and 3 only"
    ],
    "correct_option_index": 3,
    "correct_option_label": "D",
    "explanation": "The Attorney General of India can participate in proceedings of both Houses of Parliament, can speak in both houses, and take part in debates, though not as a member. However, the Attorney General cannot vote in Parliament as voting is restricted to members only. The Attorney General cannot be a member of parliamentary committees as that would require membership of the house. The Attorney General can only take part in proceedings and speak when matters related to legal issues are discussed.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["attorney_general", "parliamentary_participation", "constitutional_officials"],
    "notes": "Clarifies the role and privileges of the Attorney General of India in Parliament",
    "linked_concepts": ["Article 77", "Article 165", "Parliamentary Privileges", "Constitutional Officials"]
  },
  {
    "id": "POLITY_2013_005",
    "year": 2013,
    "subject": "Polity",
    "topic": "Cabinet and Council of Ministers",
    "subtopic": "Collective Responsibility and Ministerial Accountability",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. The Council of Ministers at the Centre shall be collectively responsible to the Parliament. 2. The Union Ministers shall hold the office during the pleasure of the President of India. 3. The Prime Minister shall communicate to the President about the proposals for Legislation.",
    "options": [
      "1 only",
      "2 and 3 only",
      "1 and 3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 3,
    "correct_option_label": "D",
    "explanation": "Statement 1 is correct: Article 75(3) provides that the Council of Ministers is collectively responsible to the Lok Sabha (part of Parliament). Statement 2 is correct: Article 75(2) states that ministers hold office during the pleasure of the President, though in practice this is exercised on the advice of the Prime Minister. Statement 3 is correct: The Prime Minister communicates to the President regarding legislative proposals as per constitutional convention and practice. All three statements reflect accurate constitutional provisions and practices.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["cabinet", "council_of_ministers", "parliamentary_responsibility"],
    "notes": "Tests understanding of cabinet structure and ministerial accountability in parliamentary system",
    "linked_concepts": ["Article 75", "Collective Responsibility", "Parliamentary Democracy"]
  },
  {
    "id": "POLITY_2013_006",
    "year": 2013,
    "subject": "Polity",
    "topic": "National Development Council",
    "subtopic": "Composition of NDC",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Who among the following constitute the National Development Council? 1. The Prime Minister. 2. The Chairman, Finance Commission. 3. Ministers of the Union Cabinet. 4. Chief Ministers of the States.",
    "options": [
      "1, 2 and 3 only",
      "1, 3 and 4 only",
      "2 and 4 only",
      "1, 2, 3 and 4"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "The NDC is constituted by: The Prime Minister (head), Union Ministers, State Chief Ministers, and Planning Commission members. Statement 2 about the Chairman of Finance Commission is incorrect - the Finance Commission Chairman is not an automatic member of NDC. The NDC's composition as per its governing resolution includes: PM, all Union Cabinet Ministers, all State and UT Chief Ministers, and members of Planning Commission. Finance Commission is a separate constitutional body.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["national_development_council", "planning", "federal_bodies"],
    "notes": "Tests knowledge of NDC composition and federal planning structure",
    "linked_concepts": ["Planning in India", "Federalism", "Executive Bodies"]
  },
  {
    "id": "POLITY_2013_007",
    "year": 2013,
    "subject": "Polity",
    "topic": "Parliamentary Committees",
    "subtopic": "Public Accounts Committee",
    "difficulty": "Easy",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: The Parliamentary Committee on Public Accounts: 1. Consists of not more than 25 Members of the Lok Sabha. 2. Scrutinizes appropriation finance accounts of Government. 3. Examines the report of Comptroller and Auditor General of India.",
    "options": [
      "1 only",
      "2 and 3 only",
      "3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "Statement 1 is incorrect: The Public Accounts Committee consists of 22 members total - 15 from Lok Sabha and 7 from Rajya Sabha, not just from Lok Sabha and not limited to 25 members. Statement 2 is correct: PAC scrutinizes appropriation and finance accounts of the Government. Statement 3 is correct: PAC examines the reports and recommendations of the Comptroller and Auditor General of India. Therefore, statements 2 and 3 are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["parliamentary_committees", "public_accounts_committee", "financial_accountability"],
    "notes": "Tests knowledge of PAC composition and functions in parliamentary oversight",
    "linked_concepts": ["Article 151", "Comptroller and Auditor General", "Parliamentary Committees"]
  },
  {
    "id": "POLITY_2013_008",
    "year": 2013,
    "subject": "Polity",
    "topic": "Money Bill",
    "subtopic": "Rajya Sabha Powers on Money Bills",
    "difficulty": "Moderate",
    "question_type": "MCQ_single",
    "question_text": "What will follow if a Money Bill is substantially amended by the Rajya Sabha?",
    "options": [
      "The Lok Sabha may still proceed with the Bill",
      "The Bill cannot be considered further",
      "The Bill is sent back to the Rajya Sabha for reconsideration",
      "A joint sitting is called to resolve the dispute"
    ],
    "correct_option_index": 0,
    "correct_option_label": "A",
    "explanation": "According to Article 109, the Rajya Sabha cannot amend a Money Bill. If the Rajya Sabha makes amendments or suggests amendments to a Money Bill, these are merely recommendations. The Lok Sabha can reject these amendments/suggestions and proceed with the Bill unchanged. The Bill is not sent back or requires joint sitting as the Rajya Sabha has no power to amend Money Bills. The Lok Sabha has the final say on Money Bills.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["money_bill", "rajya_sabha", "lok_sabha", "legislative_powers"],
    "notes": "Tests understanding of Money Bill procedures and Rajya Sabha's limited powers over them",
    "linked_concepts": ["Article 109", "Article 110", "Legislative Procedure"]
  },
  {
    "id": "POLITY_2013_009",
    "year": 2013,
    "subject": "Polity",
    "topic": "Planning and Governance",
    "subtopic": "National Development Council Functions",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. National Development Council is an organ of the Planning Commission. 2. The Economic and Social Planning is kept in the Concurrent List in the Constitution of India. 3. The Constitution of India prescribes that Panchayats should be assigned the task of preparation of plans for economic development and social justice.",
    "options": [
      "1 only",
      "2 and 3 only",
      "1 and 3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "Statement 1 is incorrect: While NDC and Planning Commission are related, NDC is not technically an organ/part of Planning Commission. They are separate bodies - NDC is an inter-governmental forum. Statement 2 is correct: Planning (economic and social) is in the Concurrent List (List III), Item 20, meaning both Parliament and States can legislate on it. Statement 3 is correct: Article 243ZD (73rd Amendment) prescribes that Panchayats should be assigned the task of preparation of plans for economic development and social justice. Statements 2 and 3 are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["planning", "concurrent_list", "panchayati_raj", "national_development_council"],
    "notes": "Tests understanding of planning structure, constitutional allocation of powers, and panchayat functions",
    "linked_concepts": ["Concurrent List", "Article 243ZD", "Federalism", "Planning System"]
  },
  {
    "id": "POLITY_2013_010",
    "year": 2013,
    "subject": "Polity",
    "topic": "Fundamental Rights and Justice",
    "subtopic": "Economic Justice in Constitution",
    "difficulty": "Moderate",
    "question_type": "MCQ_single",
    "question_text": "Economic Justice as one of the objectives of the Indian Constitution has been provided in:",
    "options": [
      "The Preamble and the Fundamental Rights",
      "The Preamble and the Directive Principles of State Policy",
      "The Fundamental Rights and the Directive Principles of State Policy",
      "None of the above"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "Economic Justice is reflected in: (1) The Preamble: which mentions 'economic justice' as an objective alongside social and political justice. (2) The Directive Principles of State Policy (Part IV): Articles 39, 39A, 42, 43, 43A and others specifically address economic justice through measures like just and humane conditions of work, living wage, abolition of poverty etc. The Fundamental Rights primarily deal with political rights and civil liberties, not economic justice directly, though they may have economic implications. Therefore, the answer is in Preamble and DPSP.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["economic_justice", "preamble", "directive_principles", "fundamental_rights"],
    "notes": "Tests understanding of where constitutional objectives are enshrined",
    "linked_concepts": ["Preamble", "Article 39", "Article 42", "Article 43", "Economic Justice"]
  },
  {
    "id": "POLITY_2013_011",
    "year": 2013,
    "subject": "Polity",
    "topic": "Parliamentary Governance",
    "subtopic": "Parliamentary Government Principles",
    "difficulty": "Easy",
    "question_type": "MCQ_multiple",
    "question_text": "In the context of India, which of the following principles is/are implied institutionally in the parliamentary government? 1. Members of the Cabinet are Members of Parliament. 2. Ministers hold the office till they enjoy confidence in the Parliament. 3. Cabinet is headed by the Head of the State.",
    "options": [
      "1 and 2 only",
      "3 only",
      "2 and 3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 0,
    "correct_option_label": "A",
    "explanation": "Statement 1 is correct: Article 75(5) prescribes that all ministers, including the Prime Minister, must be members of Parliament (either House). This is a fundamental principle of parliamentary government. Statement 2 is correct: Ministers hold office during the pleasure of the President (Article 75(2)), but in practice, they remain in office only as long as they retain the confidence of the Lok Sabha (confidence vote). Statement 3 is incorrect: The Cabinet is headed by the Prime Minister, not the Head of State (President). The President is the nominal head. Therefore, statements 1 and 2 are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["parliamentary_government", "cabinet", "prime_minister", "parliament"],
    "notes": "Tests understanding of fundamental principles underlying parliamentary system in India",
    "linked_concepts": ["Article 75", "Parliamentary Democracy", "Cabinet System"]
  },
  {
    "id": "POLITY_2013_012",
    "year": 2013,
    "subject": "Polity",
    "topic": "Rajya Sabha",
    "subtopic": "Rajya Sabha Officers and Voting Rights",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. The Chairman and the Deputy Chairman of the Rajya Sabha are not the members of that House. 2. While the nominated members of the two Houses of the Parliament have no voting right in the presidential election, they have the right to vote in the election of the Vice President.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "Statement 1 is correct: While the Chairman of Rajya Sabha is ex-officio presiding officer and Deputy Chairman is elected from among members, Article 89 and 90 specifically state they are not considered members of the House for parliamentary purposes, though they may participate in proceedings. Statement 2 is correct: Nominated members cannot vote in presidential elections (per Fourth Schedule), but they can vote in vice-presidential elections. Both statements are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["rajya_sabha", "chairman", "deputy_chairman", "nominated_members"],
    "notes": "Tests knowledge of Rajya Sabha composition and electoral voting rights",
    "linked_concepts": ["Article 89", "Article 90", "Presidential Election", "Vice-Presidential Election"]
  },
  {
    "id": "POLITY_2013_013",
    "year": 2013,
    "subject": "Polity",
    "topic": "Forest Rights",
    "subtopic": "Scheduled Tribes and Forest Dwellers Rights Act",
    "difficulty": "Easy",
    "question_type": "MCQ_single",
    "question_text": "Under the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006, who shall be the authority to initiate the process for determining the nature and extent of individual or community forest rights or both?",
    "options": [
      "The District Collector",
      "The Gram Sabha",
      "The Forest Department",
      "The Tahsildar"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "Under the Forest Rights Act, 2006, the Gram Sabha is the primary authority to initiate and determine forest rights of individuals and communities. The Act specifically provides that the Gram Sabha must verify and recommend claims for forest rights, and a three-tier committee structure is used with Gram Sabha at the village level, Taluk level committee, and District level committee. The Gram Sabha's role is crucial in ensuring community participation and local governance in forest rights recognition.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["forest_rights", "scheduled_tribes", "gram_sabha", "panchayati_raj"],
    "notes": "Tests knowledge of implementation mechanism of Forest Rights Act and gram sabha's role",
    "linked_concepts": ["Forest Rights Act 2006", "Gram Sabha", "Tribal Rights", "Panchayati Raj"]
  },
  {
    "id": "POLITY_2013_014",
    "year": 2013,
    "subject": "Polity",
    "topic": "Constitution Fundamentals",
    "subtopic": "Fundamental Provisions of Constitution",
    "difficulty": "Easy",
    "question_type": "MCQ_single",
    "question_text": "According to the Constitution of India, which of the following are fundamental for the governance of the country?",
    "options": [
      "Fundamental Rights",
      "Fundamental Duties",
      "Directive Principles of State Policy",
      "Preamble of the Constitution"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "The Directive Principles of State Policy (Part IV, Articles 36-51) are described in the Constitution as 'fundamental in the governance of the country' (Article 36 states 'Definition'). These principles guide the formulation of laws and policies. While Fundamental Rights are essential for individual freedoms and Fundamental Duties are obligations of citizens, the Constitution specifically identifies the Directive Principles as fundamental for the governance of the country. The Preamble sets objectives but is not itself fundamental for daily governance.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["directive_principles", "governance", "constitutional_framework"],
    "notes": "Tests knowledge of constitutional framework and role of different parts",
    "linked_concepts": ["Article 36", "Directive Principles", "Governance", "Constitutional Provisions"]
  },
  {
    "id": "POLITY_2013_015",
    "year": 2013,
    "subject": "Polity",
    "topic": "International Treaties",
    "subtopic": "Parliamentary Powers on International Treaties",
    "difficulty": "Moderate",
    "question_type": "MCQ_single",
    "question_text": "The Parliament can make any law for whole or any part of India for implementing international treaties:",
    "options": [
      "With the consent of all the States",
      "With the consent of the majority of States",
      "With the consent of the States concerned",
      "Without the consent of any State"
    ],
    "correct_option_index": 3,
    "correct_option_label": "D",
    "explanation": "Under Article 253 of the Constitution, the Parliament has the power to make any law for implementing international treaties, agreements, or conventions with or without the consent of the States. The Parliament can legislate on any matter, even if it falls in the State List, for the purpose of implementing international obligations. This is an exclusive power of Parliament and does not require any state consent. This reflects India's treaty-making obligations under international law.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["international_treaties", "parliament", "article_253", "federalism"],
    "notes": "Tests understanding of Parliament's special powers for international commitments",
    "linked_concepts": ["Article 253", "International Relations", "Federal Power Distribution"]
  },
  {
    "id": "POLITY_2013_016",
    "year": 2013,
    "subject": "Polity",
    "topic": "PESA Act",
    "subtopic": "Panchayat Extension to Scheduled Areas Act",
    "difficulty": "Moderate",
    "question_type": "MCQ_single",
    "question_text": "The Government enacted the Panchayat Extension to Scheduled Areas (PESA) Act in 1996. Which one of the following is NOT identified as its objective?",
    "options": [
      "To provide self-governance to tribal communities",
      "To recognize traditional rights and customs",
      "To create autonomous regions in tribal areas",
      "To free tribal people from exploitation"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "The PESA Act, 1996 aims to: (1) provide self-governance and autonomy to tribal communities through panchayats, (2) recognize and protect traditional rights and customs of scheduled tribes, (3) ensure free and fair elections in tribal areas, and (4) protect tribal communities from exploitation. However, PESA does not aim to 'create autonomous regions' - this would be a creation of separate political units, which is not its objective. PESA operates within the framework of panchayati raj and the Indian federal system, not creating separate autonomous regions.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["pesa_act", "tribal_governance", "panchayati_raj", "scheduled_areas"],
    "notes": "Tests understanding of PESA Act objectives and provisions for tribal governance",
    "linked_concepts": ["PESA 1996", "Scheduled Areas", "Tribal Rights", "Panchayati Raj"]
  },
  {
    "id": "POLITY_2013_017",
    "year": 2013,
    "subject": "Polity",
    "topic": "National Legal Services Authority",
    "subtopic": "Legal Services Provision",
    "difficulty": "Easy",
    "question_type": "MCQ_multiple",
    "question_text": "The National Legal Services Authority undertakes: 1. Its objective is to provide free and competent legal services to the weaker sections of the society on the basis of equal opportunity. 2. It issues guidelines for the State Legal Services Authorities to implement the legal programmes and schemes throughout the country.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "Statement 1 is correct: NALSA's primary objective is to provide free legal services to the poor, weaker sections, and marginalized communities on the basis of equal opportunity to avail justice. This is its core mandate. Statement 2 is correct: NALSA issues guidelines and directives to State Legal Services Authorities for implementing legal aid programmes and schemes across the country. NALSA also promotes alternative dispute resolution mechanisms like mediation and legal literacy. Both statements accurately describe NALSA's functions.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["legal_services", "nalsa", "justice_system", "legal_aid"],
    "notes": "Tests knowledge of NALSA's role in providing legal services to weaker sections",
    "linked_concepts": ["Legal Services Authorities Act", "NALSA", "Access to Justice"]
  },
  {
    "id": "POLITY_2013_018",
    "year": 2013,
    "subject": "Polity",
    "topic": "Constituent Assembly",
    "subtopic": "Composition of Constituent Assembly",
    "difficulty": "Moderate",
    "question_type": "MCQ_single",
    "question_text": "The members from the Provinces to the Constituent Assembly of India were:",
    "options": [
      "Directly elected by the people",
      "Nominated by the provinces",
      "Elected by the Provincial Assemblies",
      "Selected by the Government of India"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "The members of the Constituent Assembly from the provinces were elected by the Provincial Legislatures (Legislative Assemblies) of those provinces. This was the method adopted for representation from British India provinces. The Constituent Assembly had 389 members, of which 292 were from British Indian provinces (elected by provincial assemblies), 93 from Indian princely states, and 4 from chief commissioner's provinces. This indirect election method was used for both constituent representation and later became the basis for electoral college in presidential elections.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["constituent_assembly", "history_of_constitution", "constitutional_framework"],
    "notes": "Tests historical knowledge of how Constituent Assembly was constituted",
    "linked_concepts": ["Constituent Assembly", "1946-1950", "Constitutional Drafting"]
  },
  {
    "id": "POLITY_2013_019",
    "year": 2013,
    "subject": "Polity",
    "topic": "Parliamentary Committees",
    "subtopic": "Public Accounts Committee Composition",
    "difficulty": "Easy",
    "question_type": "MCQ_multiple",
    "question_text": "The Parliamentary Committee on Public Accounts: 1. Consists of not more than 25 Members of the Lok Sabha. 2. Scrutinizes appropriation and finance accounts of the Government. 3. Examines the report of the Comptroller and Auditor General of India.",
    "options": [
      "1 only",
      "2 and 3 only",
      "3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "Statement 1 is incorrect: The PAC has 22 members total - 15 from Lok Sabha and 7 from Rajya Sabha, not from Lok Sabha alone. Statement 2 is correct: One of PAC's primary functions is to scrutinize the appropriation and finance accounts of the Government of India. Statement 3 is correct: PAC examines the reports, recommendations, and audit observations of the Comptroller and Auditor General. Therefore, statements 2 and 3 are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["parliamentary_committees", "public_accounts_committee", "financial_accountability"],
    "notes": "Tests knowledge of PAC composition and its scrutiny functions",
    "linked_concepts": ["PAC", "CAG", "Parliamentary Oversight"]
  },
  {
    "id": "POLITY_2013_020",
    "year": 2013,
    "subject": "Polity",
    "topic": "Cabinet and Executive",
    "subtopic": "Union Cabinet Composition",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. Members of the Cabinet are Members of the Parliament. 2. Ministers hold the office till they enjoy confidence in the parliament. 3. Cabinet is headed by the Head of the State.",
    "options": [
      "1 and 2 only",
      "3 only",
      "2 and 3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 0,
    "correct_option_label": "A",
    "explanation": "Statement 1 is correct: Article 75(5) mandates that all Cabinet members must be members of either the Lok Sabha or Rajya Sabha. Statement 2 is correct: Article 75(2) provides that ministers hold office during the pleasure of the President, but they require the confidence of the Lok Sabha and resign upon loss of confidence. Statement 3 is incorrect: The Cabinet is headed by the Prime Minister, not the Head of State (President). The President is the constitutional head but not the head of the Cabinet. Cabinet members hold office on PM's advice. Statements 1 and 2 are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["cabinet", "council_of_ministers", "parliamentary_system"],
    "notes": "Tests understanding of Cabinet structure and ministerial accountability",
    "linked_concepts": ["Article 75", "Parliamentary Government", "Executive Authority"]
  },
  
  {
    "id": "POLITY_2013_021",
    "year": 2013,
    "subject": "Polity",
    "topic": "Constitutional Bodies and Committees",
    "subtopic": "Election Commission Composition and Functions",
    "difficulty": "Easy",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. The total number of ministers in the Union Government, including the Prime Minister, shall not exceed 15 percent of the total number of members in the Lok Sabha. 2. The Constitution of India classifies the ministers into four ranks: Cabinet Minister, Minister of State with Independent Charge, Minister of State and Deputy Minister.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "Statement 1 is correct: The 91st Constitutional Amendment Act, 2003 prescribes that the total number of ministers, including the Prime Minister, shall not exceed 15% of the total strength of the Lok Sabha. Statement 2 is correct: The Constitution recognizes four categories of ministers - Cabinet Ministers, Ministers of State (Independent Charge), Ministers of State, and Deputy Ministers. Both statements are accurate.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["cabinet_ministers", "91st_amendment", "union_government"],
    "notes": "Tests knowledge of constitutional provisions on ministerial structure and limits",
    "linked_concepts": ["91st Amendment Act", "Cabinet Structure", "Council of Ministers"]
  },
  {
    "id": "POLITY_2013_022",
    "year": 2013,
    "subject": "Polity",
    "topic": "Parliamentary Procedures",
    "subtopic": "Exclusive Powers of Lok Sabha",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Which of the following is/are the exclusive power(s) of Lok Sabha? 1. To ratify the declaration of Emergency. 2. To pass a motion of no-confidence against the Council of Ministers. 3. To impeach the President of India.",
    "options": [
      "1 and 2 only",
      "2 only",
      "1 and 3 only",
      "3 only"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "Statement 1 is incorrect: Declaration of National Emergency requires joint ratification by both Houses of Parliament, not exclusively by Lok Sabha. Statement 2 is correct: Only the Lok Sabha can pass a motion of no-confidence against the Council of Ministers. This is an exclusive power of Lok Sabha as per Article 75. Statement 3 is incorrect: Impeachment of the President can be initiated in either House of Parliament. Therefore, only statement 2 represents an exclusive power of Lok Sabha.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["lok_sabha", "parliamentary_powers", "no_confidence_motion"],
    "notes": "Tests understanding of exclusive powers of Lok Sabha versus powers shared with Rajya Sabha",
    "linked_concepts": ["Article 75", "No-Confidence Motion", "Parliamentary Powers", "Article 61"]
  },
  {
    "id": "POLITY_2013_023",
    "year": 2013,
    "subject": "Polity",
    "topic": "Anti-Defection Law",
    "subtopic": "Nominated Legislators and Party Joining",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "With reference to anti-defection law in India, consider the following statements: 1. The law specifies that a nominated legislator cannot join any political party within six months of being appointed to the House. 2. The law does not provide any time-frame within which the presiding officer has to decide a defection case.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "Statement 1 is incorrect: The Tenth Schedule (anti-defection law) specifies that nominated members cannot join any political party at all, not within six months. Once they join a party, they lose their membership of the House. Statement 2 is correct: The Tenth Schedule does not prescribe any specific time-frame within which the presiding officer must decide on defection cases, leaving it to the presiding officer's discretion. Only statement 2 is correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["anti_defection_law", "tenth_schedule", "nominated_members"],
    "notes": "Tests knowledge of Tenth Schedule provisions on party joining and defection procedures",
    "linked_concepts": ["Tenth Schedule", "Anti-Defection Law", "Nominated Members", "Speaker's Powers"]
  },
  {
    "id": "POLITY_2013_024",
    "year": 2013,
    "subject": "Polity",
    "topic": "Constitutional Officers",
    "subtopic": "Attorney General and Solicitor General",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. Attorney General of India and Solicitor General of India are the only officers of the Government who are allowed to participate in the meetings of the Parliament of India. 2. According to the Constitution of India, the Attorney General of India submits his resignation when the Government which appointed him resigns.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 3,
    "correct_option_label": "D",
    "explanation": "Statement 1 is incorrect: Both the Attorney General and Solicitor General can participate in Parliament, but they are not the 'only' officers. Other government law officers and officials can also participate when required for discussion of relevant matters. Statement 2 is incorrect: The Constitution does not mandate that the Attorney General must resign when the government resigns. While it is a convention that they may resign, there is no constitutional requirement. The Attorney General holds office at the pleasure of the President and can continue regardless of government change.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["attorney_general", "constitutional_officers", "parliamentary_participation"],
    "notes": "Tests understanding of AG's legal status and parliamentary participation rights",
    "linked_concepts": ["Article 76", "Constitutional Officers", "Parliamentary Privileges"]
  },
  {
    "id": "POLITY_2013_025",
    "year": 2013,
    "subject": "Polity",
    "topic": "Constitutional Remedies",
    "subtopic": "Writs - Mandamus and Quo Warranto",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "With reference to the writs issued by the Courts in India, consider the following statements: 1. Mandamus will not lie against a private organization unless it is entrusted with a public duty. 2. Mandamus will not lie against a Company even though it may be a Government Company. 3. Any public-minded person can be a petitioner to move the Court to obtain the writ of Quo Warranto.",
    "options": [
      "1 and 2 only",
      "2 and 3 only",
      "1 and 3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "Statement 1 is correct: Mandamus is available against private organizations only if they are entrusted with public duty or function. Statement 2 is incorrect: Mandamus can lie against a Government Company because it is entrusted with public functions. The nature of the organization (private or government) is secondary to whether it performs public duties. Statement 3 is correct: Quo Warranto is available to any public-spirited person or citizen, not only to those directly affected. Therefore, statements 1 and 3 are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["writs", "mandamus", "quo_warranto", "constitutional_remedies"],
    "notes": "Tests knowledge of writ jurisdiction and conditions for their issuance",
    "linked_concepts": ["Article 32", "Writs", "Mandamus", "Quo Warranto", "Habeas Corpus"]
  },
  {
    "id": "POLITY_2013_026",
    "year": 2013,
    "subject": "Polity",
    "topic": "Lok Sabha Governance",
    "subtopic": "Deputy Speaker Election and Powers",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "With reference to the Deputy Speaker of Lok Sabha, consider the following statements: 1. As per the Rules of Procedure and Conduct of Business in Lok Sabha, the election of Deputy Speaker shall be held on such date as the Speaker may fix. 2. There is a mandatory provision that the election of a candidate as Deputy Speaker of Lok Sabha shall be from either the principal opposition party or the ruling party. 3. The Deputy Speaker has the same power as the Speaker when presiding over the sitting of the House and no appeal lies against his rulings. 4. The well-established parliamentary practice regarding the appointment of Deputy Speaker is that the motion is moved by the Speaker and duly seconded by the Prime Minister.",
    "options": [
      "1 and 3 only",
      "1, 2 and 3",
      "3 and 4 only",
      "2 and 4 only"
    ],
    "correct_option_index": 0,
    "correct_option_label": "A",
    "explanation": "Statement 1 is correct: The election date is determined by the Speaker as per parliamentary rules. Statement 2 is incorrect: There is no mandatory provision that the Deputy Speaker must come from either the ruling or opposition party specifically. Statement 3 is correct: The Deputy Speaker exercises the same powers as the Speaker when presiding, and decisions made in the chair are not subject to appeal. Statement 4 is incorrect: While convention requires the motion to be moved and seconded, it is typically moved by the ruling party/government, not necessarily moved by the Speaker with the PM seconding. Statements 1 and 3 are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["deputy_speaker", "lok_sabha", "parliamentary_procedure"],
    "notes": "Tests knowledge of Deputy Speaker election procedure and constitutional powers",
    "linked_concepts": ["Rules of Procedure", "Parliamentary Practice", "Speaker's Role"]
  },
  {
    "id": "POLITY_2013_027",
    "year": 2013,
    "subject": "Polity",
    "topic": "Fifth Schedule",
    "subtopic": "Scheduled Areas and Land Transfer",
    "difficulty": "Easy",
    "question_type": "MCQ_single",
    "question_text": "If a particular area is brought under the Fifth Schedule of the Constitution of India, which one of the following statements best reflects the consequence of it?",
    "options": [
      "This would prevent the transfer of land of tribal people to non-tribal people",
      "This would create a local self-governing body in that area",
      "This would convert that area into a Union Territory",
      "The State having such areas would be declared a Special Category State"
    ],
    "correct_option_index": 0,
    "correct_option_label": "A",
    "explanation": "The Fifth Schedule provides special protections for Scheduled Areas and their residents. One of its key provisions is the protection of tribal land from transfer to non-tribal persons. Article 244 read with the Fifth Schedule restricts the sale of land by tribals to non-tribals in scheduled areas. This is a key mechanism to protect tribal communities from land exploitation. The other options are incorrect: Fifth Schedule does not create local governance bodies (that's Sixth Schedule for tribal areas in NE), does not convert areas to UTs, and does not create special category states.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["fifth_schedule", "scheduled_areas", "tribal_rights"],
    "notes": "Tests knowledge of Fifth Schedule provisions for tribal land protection",
    "linked_concepts": ["Article 244", "Scheduled Areas", "Tribal Rights", "Land Transfer"]
  },
  {
    "id": "POLITY_2013_028",
    "year": 2013,
    "subject": "Polity",
    "topic": "Budget and Finance",
    "subtopic": "Consolidated Fund and Parliament Authorization",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. The Department of Revenue is responsible for the preparation of Union Budget that is presented to the Parliament. 2. No amount can be withdrawn from the Consolidated Fund of India without the authorization from the Parliament of India. 3. All the disbursements made from the Public Account also need authorization from the Parliament of India.",
    "options": [
      "1 and 2 only",
      "2 and 3 only",
      "2 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "Statement 1 is incorrect: The Department of Economic Affairs (or the Finance Ministry) is responsible for preparation of the Union Budget, not the Department of Revenue. Statement 2 is correct: Article 267 stipulates that no money can be withdrawn from the Consolidated Fund of India without parliamentary authorization. Statement 3 is incorrect: Disbursements from the Public Account do not necessarily need parliamentary authorization as they often relate to deposits, recoveries, and repayments that are held in the Public Account as temporary holdings. Only statement 2 is correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["budget", "consolidated_fund", "parliamentary_authorization", "public_account"],
    "notes": "Tests understanding of budget preparation and fund authorization mechanisms",
    "linked_concepts": ["Article 267", "Consolidated Fund", "Budget Process", "Public Account"]
  },
  {
    "id": "POLITY_2013_029",
    "year": 2013,
    "subject": "Polity",
    "topic": "Legislative Council",
    "subtopic": "State Legislative Council Composition",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. The Legislative Council of a State in India can be larger in size than half of the Legislative Assembly of that particular State. 2. The Governor of a State nominates the Chairman of the Legislative Council of that particular State.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 3,
    "correct_option_label": "D",
    "explanation": "Statement 1 is incorrect: Article 173(3) specifies that the total number of members of a State Legislative Council shall not exceed one-third of the total number of members of the Legislative Assembly of that State. So it cannot be larger than half. Statement 2 is incorrect: Article 182 provides that members of the Legislative Council shall themselves elect the Chairman from among their members. The Governor does not nominate the Chairman; the Council members elect the Chairman. Both statements are incorrect.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["legislative_council", "state_polity", "article_173", "article_182"],
    "notes": "Tests knowledge of State Legislative Council composition and office bearer selection",
    "linked_concepts": ["Article 173", "Article 182", "State Legislature", "Bicameral Legislature"]
  },
  {
    "id": "POLITY_2013_030",
    "year": 2013,
    "subject": "Polity",
    "topic": "Parliamentary Procedures",
    "subtopic": "Preamble and Constitutional Governance",
    "difficulty": "Easy",
    "question_type": "MCQ_single",
    "question_text": "What was the exact constitutional status of India on 26th January, 1950?",
    "options": [
      "A Democratic Republic",
      "A Sovereign Democratic Republic",
      "A Sovereign Secular Democratic Republic",
      "A Sovereign Socialist Secular Democratic Republic"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "On 26th January 1950, when the Constitution came into effect, India was described in the original Preamble as a 'Sovereign Democratic Republic'. The words 'Socialist' and 'Secular' were added later through the 42nd Constitutional Amendment Act in 1976 during the Emergency period. Therefore, at the time of Constitution adoption in 1950, the exact description was 'Sovereign Democratic Republic', not including the later additions of 'Socialist' and 'Secular'.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2013
    },
    "tags": ["preamble", "constitutional_status", "42nd_amendment", "original_constitution"],
    "notes": "Tests knowledge of original Constitution provisions and subsequent amendments",
    "linked_concepts": ["42nd Amendment", "Preamble", "Constitutional History"]
  },
  {
    "id": "POLITY_2014_001",
    "year": 2014,
    "subject": "Polity",
    "topic": "Constitutional Classification",
    "subtopic": "Schedules of the Constitution",
    "difficulty": "Easy",
    "question_type": "MCQ_single",
    "question_text": "The offices of profit which are not held to disqualify a person for being a member of either House of Parliament are provided in which of the following?",
    "options": [
      "Second Schedule",
      "Fifth Schedule",
      "Eighth Schedule",
      "Tenth Schedule"
    ],
    "correct_option_index": 0,
    "correct_option_label": "A",
    "explanation": "The Second Schedule of the Constitution contains the list of offices which are exempt from the disqualification on grounds of 'office of profit'. Article 102(1) and 191(1) provide that a member becomes disqualified if they hold an office of profit under the Union or State, but the Parliament (Prevention of Disqualification) Act, 1959 exempts certain offices. These exempt offices are specified in the Second Schedule to the Constitution. The Fifth Schedule deals with Scheduled Areas, Eighth with Languages, and Tenth with Anti-Defection.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2014
    },
    "tags": ["office_of_profit", "second_schedule", "disqualification", "parliament"],
    "notes": "Tests knowledge of constitutional schedules and disqualification provisions",
    "linked_concepts": ["Second Schedule", "Office of Profit", "Article 102"]
  },
  {
    "id": "POLITY_2014_002",
    "year": 2014,
    "subject": "Polity",
    "topic": "Constitutional Provisions",
    "subtopic": "Fundamental Duties Implementation",
    "difficulty": "Easy",
    "question_type": "MCQ_single",
    "question_text": "A legislation which confers on the executive or administrative authority an unguided and uncontrolled discretionary power in the matter of the application of law violates which one of the following parts of the Constitution of India?",
    "options": [
      "Preamble to the Constitution",
      "Directive Principles of State Policy",
      "Fundamental Duties",
      "Ninth Schedule"
    ],
    "correct_option_index": 0,
    "correct_option_label": "A",
    "explanation": "Unguided and uncontrolled discretionary power granted to executive/administrative authorities violates the principle of Rule of Law, which is embedded in the Preamble through the concept of 'justice' and forms the basis of the Constitution. This is protected under Article 14 (Equality before Law), which is a Fundamental Right. Excessive discretion violates the Rule of Law principle mentioned in the Preamble. The Supreme Court has consistently held that arbitrary power is antithetical to the constitutional framework.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2014
    },
    "tags": ["rule_of_law", "arbitrary_power", "article_14", "preamble"],
    "notes": "Tests understanding of Rule of Law and constitutional constraints on executive power",
    "linked_concepts": ["Preamble", "Article 14", "Rule of Law", "Discretionary Power"]
  },
  {
    "id": "POLITY_2014_003",
    "year": 2014,
    "subject": "Polity",
    "topic": "Executive Powers",
    "subtopic": "President's Rule and Article 356",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "If the President of India exercises his power as provided under Article 356 of the Constitution in respect of a particular State, then which of the following may happen? 1. Dissolution of the State Legislative Assembly. 2. Removal of the Council of Ministers in the State. 3. Dissolution of the local bodies. 4. Suspension of elections in that State.",
    "options": [
      "1 and 2 only",
      "1 and 3 only",
      "2 and 3 only",
      "1, 2, 3 and 4"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "Under Article 356, when the President's rule is imposed: (1) Dissolution of State Legislative Assembly - Correct: The Governor recommends that the President's rule be imposed and this typically leads to dissolution of the Assembly. (2) Removal of CoM - This usually happens but is not a direct consequence of Article 356 alone. (3) Dissolution of local bodies - Correct: Local bodies (Panchayats and Municipalities) are also dissolved when President's rule is imposed. (4) Suspension of elections - This is not automatic; elections must be held within specified timeframe. Statements 1 and 3 are generally correct consequences of Article 356.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2014
    },
    "tags": ["article_356", "presidents_rule", "dissolution", "emergency"],
    "notes": "Tests understanding of consequences of imposing President's rule in a State",
    "linked_concepts": ["Article 356", "President's Rule", "State Emergency", "Local Bodies"]
  },
  {
    "id": "POLITY_2014_004",
    "year": 2014,
    "subject": "Polity",
    "topic": "Constitutional Framework",
    "subtopic": "Fundamental Rights and Restrictions",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "The Constitution of India is described as a living document. In this context, which of the following statements is/are correct? 1. The Fundamental Rights and the Directive Principles of State Policy place effective restrictions on individual liberty in the interest of State authority. 2. The Fundamental Rights place effective restrictions on the Authority of the State in the interest of individual liberty.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 1,
    "correct_option_label": "B",
    "explanation": "Statement 1 is incorrect: Directive Principles are guidelines for state action but are not enforceable, so they don't place restrictions in the same binding way. Also, their main purpose is welfare of people, not restriction of liberty. Statement 2 is correct: Fundamental Rights place restrictions on state authority to protect individual liberties. They are enforceable and limit government power. The Fundamental Rights (Articles 12-35) restrict what the state can do regarding individual freedoms, protecting citizens against state action. Only statement 2 is correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2014
    },
    "tags": ["fundamental_rights", "directive_principles", "restrictions", "liberty"],
    "notes": "Tests understanding of how Fundamental Rights restrict state authority",
    "linked_concepts": ["Fundamental Rights", "Article 12", "State Power", "Liberty"]
  },
  {
    "id": "POLITY_2014_005",
    "year": 2014,
    "subject": "Polity",
    "topic": "Parliamentary Procedures",
    "subtopic": "No-Confidence Motion",
    "difficulty": "Easy",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. There is no mention of a No-Confidence Motion in the Constitution of India. 2. A Motion of No-Confidence can be introduced in the Lok Sabha only.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "Statement 1 is correct: The Constitution does not explicitly mention 'No-Confidence Motion' in its articles. It is a creature of Rules of Procedure and Conduct of Business in the Lok Sabha, though the principle underlies Article 75 which states that Ministers are collectively responsible to the House of the People (Lok Sabha). Statement 2 is correct: A No-Confidence Motion can be introduced only in the Lok Sabha, not in the Rajya Sabha. This is specified in the Rules of Procedure. Both statements are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2014
    },
    "tags": ["no_confidence_motion", "lok_sabha", "rules_of_procedure"],
    "notes": "Tests knowledge of no-confidence motion and its constitutional basis",
    "linked_concepts": ["Article 75", "Rules of Procedure", "Parliamentary Practice"]
  },
  {
    "id": "POLITY_2014_006",
    "year": 2014,
    "subject": "Polity",
    "topic": "Law Commission",
    "subtopic": "Constitutional and Non-Constitutional Bodies",
    "difficulty": "Easy",
    "question_type": "MCQ_single",
    "question_text": "The Law Commission of India is constituted under:",
    "options": [
      "an Act of the Parliament",
      "The Constitution of India",
      "an executive order of the Government",
      "a legislation on subjects in the Concurrent List"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "The Law Commission of India is constituted through an executive order/resolution of the Government of India, not through an Act or constitutional provision. It is a non-constitutional body established by administrative action. While various law commissions have been established over the decades through executive orders, there is no Act of Parliament or constitutional article that specifically provides for the Law Commission. It is created and reconstituted periodically through Government resolutions.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2014
    },
    "tags": ["law_commission", "non_constitutional_body", "executive_order"],
    "notes": "Tests knowledge of constitutional status of the Law Commission",
    "linked_concepts": ["Non-Constitutional Bodies", "Law Commission", "Executive Power"]
  },
  {
    "id": "POLITY_2014_007",
    "year": 2014,
    "subject": "Polity",
    "topic": "Supreme Court Jurisdiction",
    "subtopic": "Original and Advisory Jurisdiction",
    "difficulty": "Easy",
    "question_type": "MCQ_single",
    "question_text": "Under which power does the President of India refer matters to the Supreme Court of India for its opinion?",
    "options": [
      "advisory jurisdiction",
      "appellate jurisdiction",
      "original jurisdiction",
      "writ jurisdiction"
    ],
    "correct_option_index": 0,
    "correct_option_label": "A",
    "explanation": "Under Article 143 of the Constitution, the President can refer matters of public importance for the opinion of the Supreme Court. This is called the 'advisory jurisdiction' of the Supreme Court. The President consults the Supreme Court on matters involving interpretation of the Constitution or questions of law of public importance. This power provides an advisory opinion that is not binding but is highly respected.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2014
    },
    "tags": ["article_143", "advisory_jurisdiction", "supreme_court"],
    "notes": "Tests knowledge of Supreme Court's advisory jurisdiction under Article 143",
    "linked_concepts": ["Article 143", "Advisory Opinion", "Presidential Referral"]
  },
  {
    "id": "POLITY_2014_008",
    "year": 2014,
    "subject": "Polity",
    "topic": "Cabinet and Executive",
    "subtopic": "Cabinet Secretariat Functions",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Which of the following is/are the function/functions of the Cabinet Secretariat? 1. Preparation of agenda for Cabinet Meetings. 2. Secretarial assistance to Cabinet Committees. 3. Allocation of financial resources to the Ministries.",
    "options": [
      "1 only",
      "2 and 3 only",
      "1 and 2 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "Statement 1 is correct: The Cabinet Secretariat prepares the agenda for Cabinet meetings and organizes the meetings. Statement 2 is correct: The Cabinet Secretariat provides secretarial support to Cabinet Committees by maintaining records, coordinating between committees, and facilitating information flow. Statement 3 is incorrect: Allocation of financial resources to Ministries is done by the Department of Expenditure/Finance, not by the Cabinet Secretariat. The Cabinet Secretariat's role is administrative coordination, not financial allocation. Statements 1 and 2 are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2014
    },
    "tags": ["cabinet_secretariat", "cabinet_committees", "executive_administration"],
    "notes": "Tests understanding of Cabinet Secretariat's role and functions",
    "linked_concepts": ["Cabinet Secretariat", "Cabinet Committees", "Coordination"]
  },
  {
    "id": "POLITY_2014_009",
    "year": 2014,
    "subject": "Polity",
    "topic": "Planning",
    "subtopic": "Planning in India",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Which of the following are associated with 'Planning' in India? 1. The Planning Commission. 2. The National Development Council. 3. The Ministry of Statistics and Programme Implementation.",
    "options": [
      "1 and 2 only",
      "1 and 3 only",
      "2 and 3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 3,
    "correct_option_label": "D",
    "explanation": "All three statements are correct: (1) The Planning Commission (now replaced by NITI Aayog) was the apex body responsible for formulating five-year plans. (2) The National Development Council (NDC) approved plans and coordinated between center and states. (3) The Ministry of Statistics and Programme Implementation (now Ministry of Planning) is responsible for monitoring and evaluating plan implementations, collecting statistics, and implementing programs. All three are/were associated with India's planning process.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2014
    },
    "tags": ["planning_commission", "ndc", "five_year_plans", "planning_ministry"],
    "notes": "Tests knowledge of institutions involved in India's planning framework",
    "linked_concepts": ["Planning Commission", "NDC", "NITI Aayog", "Five Year Plans"]
  },
  {
    "id": "POLITY_2015_001",
    "year": 2015,
    "subject": "Polity",
    "topic": "Panchayati Raj",
    "subtopic": "Fifth Schedule and Panchayat Functions",
    "difficulty": "Easy",
    "question_type": "MCQ_single",
    "question_text": "According to the Constitution of India, the Fifth Schedule is related to the administration and control of Scheduled Areas and Scheduled Tribes. Which one of the following best describes the role of the Seventh Schedule in relation to this?",
    "options": [
      "protect the interests of Scheduled Tribes",
      "determine the boundaries between States",
      "determine the powers, authority and responsibilities of Panchayats",
      "protect the interests of all the border States"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "The Seventh Schedule of the Constitution divides governmental powers between the Union and States through three lists: Union List, State List, and Concurrent List. It does not directly determine Panchayat powers, but through the distribution of powers it affects how panchayats operate. However, in the context of this question, the best answer relates to how the Seventh Schedule determines powers and responsibilities. The Panchayats' functions are actually provided in the Eleventh and Twelfth Schedules. The question seems to test understanding that the Seventh Schedule delineates powers, though the specific answer regarding Panchayats is better covered by other schedules.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2015
    },
    "tags": ["seventh_schedule", "panchayati_raj", "federalism"],
    "notes": "Tests knowledge of constitutional schedules and their functions",
    "linked_concepts": ["Seventh Schedule", "Panchayats", "Division of Powers"]
  },
  {
    "id": "POLITY_2015_002",
    "year": 2015,
    "subject": "Polity",
    "topic": "Parliament and Budget",
    "subtopic": "Money Bills and Parliamentary Authorization",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. The Department of Revenue is responsible for the preparation of Union Budget that is presented to the Parliament. 2. No amount can be withdrawn from the Consolidated Fund of India without the authorization from the Parliament of India. 3. All the disbursements made from the Public Account also need the authorization from the Parliament of India.",
    "options": [
      "1 and 2 only",
      "2 and 3 only",
      "2 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "Statement 1 is incorrect: The Union Budget is prepared by the Department of Economic Affairs (Finance Ministry), not the Department of Revenue. Statement 2 is correct: Article 266 provides that all moneys received by the Union Government go to the Consolidated Fund of India, and no money can be withdrawn without parliamentary authorization. Statement 3 is incorrect: The Public Account contains moneys held temporarily (deposits, recoveries) and withdrawals from it do not require parliamentary authorization as they are not expenditure from the Consolidated Fund. Only statement 2 is correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2015
    },
    "tags": ["budget", "consolidated_fund", "public_account", "parliament_authorization"],
    "notes": "Tests understanding of budget preparation and fund withdrawal procedures",
    "linked_concepts": ["Consolidated Fund", "Public Account", "Budget", "Article 266"]
  },
  {
    "id": "POLITY_2015_003",
    "year": 2015,
    "subject": "Polity",
    "topic": "Directive Principles",
    "subtopic": "DPSP and State Policy",
    "difficulty": "Easy",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements about the Directive Principles of State Policy: 1. The Principles spell out the socio-economic democracy in the country. 2. The provisions contained in these Principles are not enforceable by any court.",
    "options": [
      "1 only",
      "2 only",
      "Both 1 and 2",
      "Neither 1 nor 2"
    ],
    "correct_option_index": 2,
    "correct_option_label": "C",
    "explanation": "Statement 1 is correct: The Directive Principles (Articles 36-51) lay out the socio-economic objectives that the state should strive to achieve, embodying the vision of a welfare state with economic justice and social security. Statement 2 is correct: Article 37 explicitly states that the provisions in Part IV (Directive Principles) are not enforceable by any court of law. They are moral directions, not legal obligations. Both statements are correct.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2015
    },
    "tags": ["directive_principles", "socio_economic", "non_enforceable"],
    "notes": "Tests knowledge of nature and scope of Directive Principles",
    "linked_concepts": ["Article 36-51", "Article 37", "DPSP", "Welfare State"]
  },
  {
    "id": "POLITY_2015_004",
    "year": 2015,
    "subject": "Polity",
    "topic": "Rajya Sabha Powers",
    "subtopic": "Money Bills and Legislative Authority",
    "difficulty": "Moderate",
    "question_type": "MCQ_multiple",
    "question_text": "Consider the following statements: 1. The Rajya Sabha has no power either to reject or to amend a Money Bill. 2. The Rajya Sabha cannot vote on the Demands for Grants. 3. The Rajya Sabha cannot discuss the Annual Financial Statement.",
    "options": [
      "1 only",
      "1 and 2 only",
      "2 and 3 only",
      "1, 2 and 3"
    ],
    "correct_option_index": 3,
    "correct_option_label": "D",
    "explanation": "Statement 1 is correct: Per Article 109, Rajya Sabha cannot reject or amend Money Bills. It can only recommend amendments which Lok Sabha is free to accept or reject. Statement 2 is correct: Demands for Grants can only be voted on in the Lok Sabha. Rajya Sabha has no voting power on the Demands. Statement 3 is correct: The Annual Financial Statement can be discussed in both Houses, but according to procedure, the Rajya Sabha typically does not discuss it in the same manner as Lok Sabha does. All three statements reflect the restrictions on Rajya Sabha's financial powers.",
    "source": {
      "exam": "UPSC_CSE_Prelims",
      "paper": "GS1",
      "year": 2015
    },
    "tags": ["rajya_sabha", "money_bill", "financial_statement", "demands_for_grants"],
    "notes": "Tests understanding of Rajya Sabha's limited financial powers",
    "linked_concepts": ["Article 109", "Money Bill", "Article 110", "Financial Legislation"]
  }
  ]
 
